Autodesk.Revit.DB.DefaultDivideSettings.SetSurfaceDistance(Autodesk.Revit.DB.UVGridlineType,System.Double)
Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
gridlines:
U-gridlines or V-gridlines.
distance:
A default distance for a layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for distance must be positive.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.GetSurfaceDistance(Autodesk.Revit.DB.UVGridlineType)
Gets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
gridlines:
U-gridlines or V-gridlines.
Returns:
The default distance for the layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.SetSurfaceNumber(Autodesk.Revit.DB.UVGridlineType,System.Int32)
Sets the default Divided Surface number for a fixed number layout for U or V gridlines.
gridlines:
U-gridlines or V-gridlines.
number:
A default number for a fixed number layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for number is not positive.
-or-
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.GetSurfaceNumber(Autodesk.Revit.DB.UVGridlineType)
Gets the default Divided Surface number for a fixed number layout for U or V gridlines.
gridlines:
U-gridlines or V-gridlines.
Returns:
The default number for a fixed number layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.SetSurfaceLayout(Autodesk.Revit.DB.UVGridlineType,Autodesk.Revit.DB.SpacingRuleLayout)
Sets the default Divided Surface layout for U or V gridlines.
gridlines:
U-gridlines or V-gridlines.
layout:
A layout spacing rule.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.GetSurfaceLayout(Autodesk.Revit.DB.UVGridlineType)
Gets the default Divided Surface layout for U or V gridlines.
gridlines:
U-gridlines or V-gridlines.
Returns:
The layout spacing rule.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.GetDefaultDivideSettings(Autodesk.Revit.DB.Document)
Obtains the DefaultDivideSettings object for the specified document.
cda:
A document.
Returns:
The DefaultDivideSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DefaultDivideSettings.PathMeasurementType
A default Divided Path measurement type for distance layouts.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.PathDistance
A default Divided Path distance for a fixed, minimum, or maximum distance layout.
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.PathNumber
A default Divided Path number for a fixed number layout.
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings.PathLayout
A default Divided Path layout.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.DefaultDivideSettings
Provides access to project-wide divide settings.
Since:
2014